In [30]:
import pandas as pd 
import numpy as np
import os

In [31]:
madrid_dfs = []
for i in range(1,19):
    path = os.path.join("csvs_per_year", f"madrid_{2000 + i}.csv")
    df = pd.read_csv(path)
    madrid_dfs.append(df)

In [32]:
madrid_dfs[0].head()

,date,BEN,CO,EBE,MXY,NMHC,NO_2,NOx,OXY,O_3,PM10,PXY,SO_2,TCH,TOL,station
0,2001-08-01 01:00:00,NaN,0.37,NaN,NaN,NaN,58.400002,87.150002,NaN,34.529999,105.000000,NaN,6.34,NaN,NaN,28079001
1,2001-08-01 01:00:00,1.5,0.34,1.49,4.1,0.07,56.250000,75.169998,2.11,42.160000,100.599998,1.73,8.11,1.24,10.82,28079035
2,2001-08-01 01:00:00,NaN,0.28,NaN,NaN,NaN,50.660000,61.380001,NaN,46.310001,100.099998,NaN,7.85,NaN,NaN,28079003
3,2001-08-01 01:00:00,NaN,0.47,NaN,NaN,NaN,69.790001,73.449997,NaN,40.650002,69.779999,NaN,6.46,NaN,NaN,28079004
4,2001-08-01 01:00:00,NaN,0.39,NaN,NaN,NaN,22.830000,24.799999,NaN,66.309998,75.180000,NaN,8.80,NaN,NaN,28079039

In [33]:
madrid_dfs[1].head()

,date,BEN,CO,EBE,MXY,NMHC,NO_2,NOx,OXY,O_3,PM10,PXY,SO_2,TCH,TOL,station
0,2002-04-01 01:00:00,NaN,1.39,NaN,NaN,NaN,145.100006,352.100006,NaN,6.54,41.990002,NaN,21.32,NaN,NaN,28079001
1,2002-04-01 01:00:00,1.93,0.71,2.33,6.2,0.15,98.150002,153.399994,2.67,6.85,20.980000,2.53,11.66,1.82,10.98,28079035
2,2002-04-01 01:00:00,NaN,0.80,NaN,NaN,NaN,103.699997,134.000000,NaN,13.01,28.440001,NaN,13.67,NaN,NaN,28079003
3,2002-04-01 01:00:00,NaN,1.61,NaN,NaN,NaN,97.599998,268.000000,NaN,5.12,42.180000,NaN,16.99,NaN,NaN,28079004
4,2002-04-01 01:00:00,NaN,1.90,NaN,NaN,NaN,92.089996,237.199997,NaN,7.28,76.330002,NaN,15.26,NaN,NaN,28079039

In [34]:
madrid_dfs[1].tail()

,date,BEN,CO,EBE,MXY,NMHC,NO_2,NOx,OXY,O_3,PM10,PXY,SO_2,TCH,TOL,station
217291,2002-11-01 00:00:00,4.16,1.14,NaN,NaN,NaN,81.080002,265.700012,NaN,7.21,36.750000,NaN,13.210000,NaN,NaN,28079022
217292,2002-11-01 00:00:00,3.67,1.73,2.89,NaN,0.38,113.900002,373.100006,NaN,5.66,63.389999,NaN,15.640000,1.78,15.690000,28079023
217293,2002-11-01 00:00:00,1.37,0.58,1.17,2.37,0.15,65.389999,107.699997,1.30,9.11,9.640000,0.94,5.620000,1.43,4.330000,28079024
217294,2002-11-01 00:00:00,4.51,0.91,4.83,10.99,NaN,149.800003,202.199997,1.00,5.75,NaN,5.52,24.219999,NaN,22.129999,28079025
217295,2002-11-01 00:00:00,3.11,1.17,3.00,7.77,0.26,80.110001,180.300003,2.25,7.38,29.240000,3.35,12.910000,1.54,15.510000,28079099

In [35]:
total_df = pd.concat(madrid_dfs, axis=0)

In [36]:
#converting mg/m³ to μg/m³ for uniformity
total_df["CO"]=total_df["CO"]/1000
total_df["TCH"]=total_df["TCH"]/1000
total_df["CH4"]=total_df["CH4"]/1000

In [37]:
stations = pd.read_csv("stations.csv", index_col="name")
stations.loc[["Ensanche de Vallecas", "Urb. Embajada", "Pza. Fernández Ladreda"]]

,id,address,lon,lat,elevation
name,,,,,
Ensanche de Vallecas,28079054,Avda La Gavia / Avda. Las Suertes,-3.612117,40.372933,627
Urb. Embajada,28079055,C/ Riaño (Barajas),-3.580747,40.462531,618
Pza. Fernández Ladreda,28079056,Pza. Fernández Ladreda - Avda. Oporto,-3.718728,40.384964,604

In [38]:
Ensanche_df = total_df[total_df["station"] == 28079054].reset_index(drop=True)
Ensanche_df.head()

,date,BEN,CO,EBE,MXY,NMHC,NO_2,NOx,OXY,O_3,PM10,PXY,SO_2,TCH,TOL,station,PM25,NO,CH4
0,2009-12-11 01:00:00,NaN,NaN,NaN,NaN,NaN,77.820000,124.500000,NaN,4.03,NaN,NaN,NaN,NaN,NaN,28079054,NaN,NaN,NaN
1,2009-12-11 02:00:00,NaN,NaN,NaN,NaN,NaN,70.120003,114.699997,NaN,4.09,NaN,NaN,NaN,NaN,NaN,28079054,NaN,NaN,NaN
2,2009-12-11 03:00:00,NaN,NaN,NaN,NaN,NaN,60.680000,95.790001,NaN,3.65,NaN,NaN,NaN,NaN,NaN,28079054,NaN,NaN,NaN
3,2009-12-11 04:00:00,NaN,NaN,NaN,NaN,NaN,49.509998,58.020000,NaN,6.03,NaN,NaN,NaN,NaN,NaN,28079054,NaN,NaN,NaN
4,2009-12-11 05:00:00,NaN,NaN,NaN,NaN,NaN,46.630001,59.759998,NaN,4.40,NaN,NaN,NaN,NaN,NaN,28079054,NaN,NaN,NaN

In [39]:
Urb_Embajada_df = total_df[total_df["station"] == 28079055].reset_index(drop=True)
Pza_Fernández_df = total_df[total_df["station"] == 28079056].reset_index(drop=True)

In [40]:
Ensanche_col_null = (Ensanche_df.isna().sum()/Ensanche_df.shape[0]*100)
to_drop = Ensanche_col_null[Ensanche_col_null.values >= 70].index
to_drop
#100% null value for polutants: ['CH4', 'PM25', 'CO', 'EBE', 'MXY', 'NMHC', 'OXY', 'BEN', 'PM10', 'PXY', 'SO_2', 'TCH', 'TOL']

Index(['BEN', 'CO', 'EBE', 'MXY', 'NMHC', 'NOx', 'OXY', 'PM10', 'PXY', 'SO_2',
       'TCH', 'TOL', 'PM25', 'CH4'],
      dtype='object')

In [41]:
#dropping columns with 100% Nan
Ensanche_df.drop(to_drop, axis=1, inplace=True)

In [42]:
Urb_Embajada_col_null = (Urb_Embajada_df.isna().sum()/Urb_Embajada_df.shape[0]*100)
to_drop = Urb_Embajada_col_null[Urb_Embajada_col_null.values >= 70].index
to_drop

Index(['CO', 'MXY', 'NOx', 'OXY', 'O_3', 'PXY', 'SO_2', 'PM25', 'CH4'], dtype='object')

In [43]:
Urb_Embajada_df.drop(to_drop, axis=1, inplace=True)

In [44]:
Pza_Fernández_col_null = (Pza_Fernández_df.isna().sum()/Pza_Fernández_df.shape[0]*100)
to_drop = Pza_Fernández_col_null[Pza_Fernández_col_null.values >= 70].index
to_drop

Index(['BEN', 'EBE', 'MXY', 'NMHC', 'NOx', 'OXY', 'PM10', 'PXY', 'SO_2', 'TCH',
       'TOL', 'PM25', 'CH4'],
      dtype='object')

In [45]:
Pza_Fernández_df.drop(to_drop, axis=1, inplace=True)

In [46]:
Urb_Embajada_df.isna().sum().sum()

30445

## filling missing values less than 1% with 0

In [47]:
Urb_Embajada_col_null[Urb_Embajada_col_null.values <= 1]

date       0.000000
NO_2       0.385930
PM10       0.831128
station    0.000000
dtype: float64

In [48]:
#Urb_Embajada_df.columns
Urb_Embajada_df["PM10"].fillna(0, inplace=True)
Urb_Embajada_df["NO_2"].fillna(0, inplace=True)

In [49]:
Urb_Embajada_df.isna().sum().sum()

29562

In [50]:
Ensanche_col_null[Ensanche_col_null.values <= 1]

date       0.000000
NO_2       0.436663
O_3        0.643432
station    0.000000
dtype: float64

In [51]:
Ensanche_df["O_3"].fillna(0, inplace=True)
Ensanche_df["NO_2"].fillna(0, inplace=True)

In [52]:
Pza_Fernández_col_null[Pza_Fernández_col_null.values <= 1]

date       0.000000
CO         0.622717
NO_2       0.718200
O_3        0.719584
station    0.000000
dtype: float64

In [53]:
Pza_Fernández_df["CO"].fillna(0, inplace=True)
Pza_Fernández_df["NO_2"].fillna(0, inplace=True)
Pza_Fernández_df["O_3"].fillna(0, inplace=True)

## Missing values are more than 1% and less than 70% with median

In [54]:
median_fill_col = Urb_Embajada_col_null[(Urb_Embajada_col_null.values >= 1) & (Urb_Embajada_col_null.values <= 70)].index
median_fill_col

Index(['BEN', 'EBE', 'NMHC', 'TCH', 'TOL', 'NO'], dtype='object')

In [55]:
for col in median_fill_col:
    Urb_Embajada_df[col].fillna((Urb_Embajada_df[col]).median(), inplace=True)

In [56]:
Urb_Embajada_df.isna().sum().sum()

0

In [57]:
median_fill_col = Pza_Fernández_col_null[(Pza_Fernández_col_null.values >= 1) & (Pza_Fernández_col_null.values <= 70)].index
median_fill_col

Index(['NO'], dtype='object')

In [58]:
for col in median_fill_col:
    Pza_Fernández_df[col].fillna((Pza_Fernández_df[col]).median(), inplace=True)

In [59]:
median_fill_col = Ensanche_col_null[(Ensanche_col_null.values >= 1) & (Ensanche_col_null.values <= 70)].index
median_fill_col

Index(['NO'], dtype='object')

In [60]:
for col in median_fill_col:
    Ensanche_df[col].fillna((Ensanche_df[col]).median(), inplace=True)

In [61]:
Ensanche_df.isna().sum().sum()

0

In [62]:
Pza_Fernández_df.isna().sum().sum()

0

In [63]:
Urb_Embajada_df.isna().sum().sum()

0

## Duplicate values

In [65]:
Ensanche_df.duplicated().sum()

0

In [66]:
Urb_Embajada_df.duplicated().sum()

0

In [67]:
Pza_Fernández_df.duplicated().sum()

0

In [68]:
Ensanche_df.to_csv("Ensanche.csv", index=False)
Urb_Embajada_df.to_csv("Urb_Embajada.csv", index=False)
Pza_Fernández_df.to_csv("Pza_Fernández.csv", index=False)